[
  {
    "id": "Werkstudent - Sensor- & HMI-Softwareentwicklung (Python)",
    "title": "Werkstudent - Sensor- & HMI-Softwareentwicklung",
    "tag": "Embedded Systems · Python · HMI",
    "preview": "images/project-sensor-hmi.svg",
    "previewAlt": "Vorschau: Sensor- und HMI-Softwareentwicklung",
    "summary": "Entwicklung eines Python-basierten Systems fuer Sensor-Kommunikation und HMI-Steuerung zur Echtzeit-Visualisierung und Interaktion.",
    "details": "In diesem internen Unternehmensprojekt entwickelte ich eine Python-basierte Software zur Kommunikation mit Sensor-Hardware, zur Echtzeit-Visualisierung und zur Steuerung ueber ein einfaches HMI. Das System basiert auf einer Zustandsmaschine, um stabilen Betrieb, robuste Fehlerbehandlung und eine zuverlaessige Hardware-Interaktion zu sichern.",
    "list": [
      "Rolle: Alleinverantwortlich fuer Geraetekommunikation, HMI-Logik und Systemintegration.",
      "Aufgaben: Zustandsmaschinen-Design, Sensor-Kommunikation, Datenvisualisierung, Tests und Dokumentation.",
      "Ergebnis: Stabiles und fehlertolerantes System fuer Echtzeit-Steuerung und Monitoring.",
      "Stack: Python, TensorFlow, Multiprocessing, Embedded Hardware."
    ]
  },
  {
    "id": "Werkstudent - IoT & Cloud Datenpipeline (Python)",
    "title": "Werkstudent - IoT & Cloud Datenpipeline",
    "tag": "IoT · Backend · Datenvisualisierung",
    "preview": "images/project-iot-cloud.svg",
    "previewAlt": "Vorschau: IoT- und Cloud-Datenpipeline",
    "summary": "Konzeption und Umsetzung einer IoT-Datenpipeline von Sensor-Hardware bis Cloud-Storage und Visualisierung.",
    "details": "In diesem internen Unternehmensprojekt habe ich eine durchgaengige Datenpipeline entworfen und umgesetzt, die Sensordaten automatisch in die Cloud uebertraegt. Die Architektur ermoeglicht sichere Aufnahme, strukturierte Speicherung und Visualisierung fuer Echtzeit- und Verlaufsdaten.",
    "list": [
      "Rolle: Alleinverantwortlich fuer Backend-Datenverarbeitung und Systemintegration.",
      "Aufgaben: Cloud-Architektur, Dateningestion, Verarbeitung, Visualisierung, Tests und Dokumentation.",
      "Ergebnis: Zuverlaessiger Sensor-zu-Cloud-Datenfluss mit Dashboards fuer Monitoring und Analyse.",
      "Stack: Python, AWS IoT Core, Lambda, Athena, QuickSight, Pandas, NumPy, Matplotlib."
    ]
  },
  {
    "id": "Software-Reengineering - GUI & Echtzeitdaten (Python)",
    "title": "Software-Reengineering - GUI & Echtzeitdaten",
    "tag": "GUI · Embedded · Reengineering",
    "preview": "images/project-gui-reengineering.svg",
    "previewAlt": "Vorschau: GUI-Reengineering und Echtzeitdaten",
    "summary": "Refactoring und Optimierung einer bestehenden GUI-Anwendung zur Verbesserung von Datenintegritaet und Reaktionszeit.",
    "details": "Dieses Projekt analysierte und verbesserte eine GUI-Anwendung, die bei Echtzeit-Visualisierung Daten verlor. Ich refaktorierte Teile der Datenpipeline zur Steigerung von Stabilitaet und Reaktionszeit. Zusaetzlich wurde ein leichtgewichtiges Web-Interface auf Linux bereitgestellt, um Echtzeitdaten anzuzeigen und die Hardware zu steuern.",
    "list": [
      "Rolle: Alleinverantwortlich fuer Analyse, Refactoring und Systemoptimierung.",
      "Aufgaben: Debugging, Architektur-Verbesserung, Echtzeit-Datenhandling, Tests und Dokumentation.",
      "Ergebnis: Hoehere Datenzuverlaessigkeit und Stabilitaet bei Echtzeit-Visualisierung und Geraetesteuerung.",
      "Stack: Python, PySide / Qt, Matplotlib, Linux, Embedded Hardware."
    ]
  },
  {
    "id": "TinyML auf ESP32 (Proseminar)",
    "title": "TinyML auf ESP32",
    "tag": "Machine Learning · Embedded Systems",
    "preview": "images/project-tinyml-esp32.svg",
    "previewAlt": "Vorschau: TinyML auf ESP32",
    "summary": "Implementierung und Evaluation eines kompakten neuronalen Netzes auf einem ESP32 im Rahmen eines ML-Proseminars.",
    "details": "In diesem akademischen Teamprojekt wurde ein kompaktes Modell reproduziert und mit TinyML-Techniken auf einen ESP32 portiert. Dazu gehoerten Datenaufbereitung, Modellbewertung und ressourcenbewusste Implementierung unter Hardware-Beschraenkungen.",
    "list": [
      "Rolle: Teammitglied mit Fokus auf Datensatzverarbeitung und Dokumentation.",
      "Aufgaben: Omniglot-Datensatz, Evaluation und Mitarbeit am Projektbericht.",
      "Ergebnis: Erfolgreiches Deployment und Evaluation eines Netzes auf ressourcenbeschraenkter Hardware.",
      "Stack: Python, TinyML, ESP32."
    ]
  }
]